wegam/STM32F10xUSBE/FWLIB/Lib/PHY/R61509V.c
/**************************************************************************************************
* [Function] LCD_SetDrawMode:  函数功能、注意事项等的描述
* [No param]
**************************************************************************************************/
void R61509V_SetDrawMode( void )
{
#define BGR	( (u16) 1 << 12)        /*RGB顺序 */
#define DFM	( (u16) 1 << 14)        /*16-bit颜色，只能使用16-bit/8-bit接口 */
#define TRI	( (u16) 0 << 15)        /*8-bit接口下两次传输，16-bit接口下一次传输 */

	u8 Dat, HR, VR, AM, ORG;

	const u8 VHM[4][4][2] = { 6, 4, 5, 7, 0, 2, 3, 1,
				  5, 1, 0, 4, 3, 7, 6, 2,
				  0, 2, 3, 1, 6, 4, 5, 7,
				  3, 7, 6, 2, 5, 1, 0, 4 };


	if ( LCD_GetCfg()->DrawMode.Mode == 0 )
	{
		ORG	= 0;
		VR	= 0;
		HR	= 0;
		AM	= 0;
	}else {
		ORG	= 0;
		Dat	= VHM[LCD_GetCfg()->ScrnRotat][LCD_GetCfg()->DrawMode.Rotat][LCD_GetCfg()->DrawMode.Mirror];
		if ( Dat & 0x04 )
			VR = 1;
		else
			VR = 0;
		if ( Dat & 0x02 )
			HR = 1;
		else
			HR = 0;
		if ( Dat & 0x01 )
			AM = 1;
		else
			AM = 0;
	}

	R61509V_WriteCMD( R61509V_R003_EM, TRI | DFM | BGR | (ORG << 7) | (VR << 5) | (HR << 4) | (AM << 3) );
}


/**************************************************************************************************
* [Function] LCD_PowerOff:  关闭LCD 电源
* [No param]
**************************************************************************************************/
void R61509V_PowerOff( void )
{
	R61509V_WriteCMD( R61509V_R009_DC3, 0 );
	R61509V_Delay( 1 );
	R61509V_BL_OFF;
}


/**************************************************************************************************
* [Function] LCD_DispOff:  关闭LCD显示( 黑屏?)
* [No param]
**************************************************************************************************/
void R61509V_DispOff( void )
{
	R61509V_WriteCMD( R61509V_R007_DC1, 0x0000 );
}


/**************************************************************************************************
* [Function] LCD_PowerOn: LCD 上电并初始化相关寄存器
* [No param]
**************************************************************************************************/
void R61509V_PowerOn( void )
{
	R61509V_RST_HIGH;
	R61509V_Delay( 10 );
	R61509V_RST_LOW;
	R61509V_Delay( 20 );
	R61509V_RST_HIGH;
	R61509V_Delay( 50 );

	R61509V_BL_ON;
	
	R61509V_WriteCMD( R61509V_R000_IR, 0x0000 );
	R61509V_WriteCMD( R61509V_R000_IR, 0x0000 );
	R61509V_WriteCMD( R61509V_R000_IR, 0x0000 );
	R61509V_WriteCMD( R61509V_R000_IR, 0x0000 );
	R61509V_Delay( 100 );
	R61509V_WriteCMD( R61509V_R400_BINL, 0x6400 );   /*50*8 lines LCD,start scan at line 0 */
	R61509V_WriteCMD( R61509V_R008_DC2, 0x0808 );    /*8 lines for front and back porch period */
	
	R61509V_WriteCMD( R61509V_R300_YC1, 0x0C00 );    /*gammar correction */
	R61509V_WriteCMD( R61509V_R301_YC2, 0x5A0B );
	R61509V_WriteCMD( R61509V_R302_YC3, 0x0906 );
	R61509V_WriteCMD( R61509V_R303_YC4, 0x1017 );
	R61509V_WriteCMD( R61509V_R304_YC5, 0x2300 );
	R61509V_WriteCMD( R61509V_R305_YC6, 0x1700 );
	R61509V_WriteCMD( R61509V_R306_YC7, 0x6309 );
	R61509V_WriteCMD( R61509V_R307_YC8, 0x0C09 );
	R61509V_WriteCMD( R61509V_R308_YC9, 0x100C );
	R61509V_WriteCMD( R61509V_R309_YC10, 0x2232 );
	
	R61509V_WriteCMD( R61509V_R010_PIC1, 0x0019 );   /*25 clocks per line */
	
	R61509V_WriteCMD( R61509V_R100_PC1, 0x0330 );    /*LCD in highest current,set-up factor */
	R61509V_WriteCMD( R61509V_R101_PC2, 0x0247 );    /*set-up 1 and 2 clock frequence,VCI voltage */
	R61509V_WriteCMD( R61509V_R102_PC3, 0xC1B0 );    /*power on */
	
	R61509V_Delay( 50 );
	
	R61509V_WriteCMD( R61509V_R009_DC3, 0x0001 );    /*source output level to drive non-display V0 to V63 */
	R61509V_WriteCMD( R61509V_R00B_ECC, 0x0000 );    /*262k colors */
	
	R61509V_WriteCMD( R61509V_R00C_EDIC1, 0x0000 );  /*18-bit RGB interface,interal clock interface,RAM access via system interface,RAM write cycle 1frame */
	R61509V_WriteCMD( R61509V_R00F_EDIC2, 0x0000 );  /*DOTCLOCK HSYNCX VSYNCX polarity(RGB IF) */
	
	R61509V_WriteCMD( R61509V_R011_PIC2, 0x0101 );   /* 1clock in adjacent gate,1clock source output delay period */
	R61509V_WriteCMD( R61509V_R012_PIC3, 0x0000 );   /*0 clock VCOM equalize period,0clock source equalize period */
	R61509V_WriteCMD( R61509V_R013_PIC4, 0x0001 );   /* 1clock VCOM alternating timing */
	R61509V_WriteCMD( R61509V_R014_PIC5, 0x0055 );   /*dotclock high and low period ratio(RGB IF) */
	R61509V_WriteCMD( R61509V_R020_PIC6, 0x0019 );   /*DIV of dotclock,dotclock in 1line period (RGB IF) */
	R61509V_WriteCMD( R61509V_R021_PIC7, 0x0101 );   /* 1 clock in non-overlap of adjacent gate output and source output delay */
	R61509V_WriteCMD( R61509V_R022_PIC8, 0x0000 );   /*0 clock in low power VCOM drive and source equalize(RGB IF) */
	R61509V_WriteCMD( R61509V_R023_PIC9, 0x0001 );   /* 1 clock VCOM alternating point (RGB IF) */
	
	R61509V_WriteCMD( R61509V_R090_FMC, 0x0000 );    /* */
	R61509V_WriteCMD( R61509V_R103_PC4, 0x0D00 );    /*factor of VREG1OUT for VCOM alternating voltage */
	R61509V_WriteCMD( R61509V_R401_BIDC, 0x0000 );   /*non-lit display level,vertical roll OFF,display invert OFF */
	R61509V_WriteCMD( R61509V_R002_DWC, 0x0100 );    /*line inversion */
	R61509V_WriteCMD( R61509V_R001_DOC, 0x0100 );    /*source driver shift form s1 to s720, */
	R61509V_WriteCMD( R61509V_R007_DC1, 0x0000 );    /*partial display disable,base image display disbale */
}




/**************************************************************************************************
* [Function] LCD_DrawPixelEx:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 color: description
**************************************************************************************************/
void R61509V_DrawPixelEx( u16 x, u16 y, u16 color )
{
	t_Point p;
	p.x	= x;
	p.y	= y;
//	R61509V_DrawDot(p,color);		//画点
}


/**************************************************************************************************
* [Function] LCD_GetPixel:  函数功能、注意事项等的描述
* [param01]u16 X0: description
* [param02]u16 Y0: description
* [return]u16: description
**************************************************************************************************/
u16 R61509V_GetPixel( t_Sreen_Rotate ScrnRotat, t_PixCfg PixCfg, t_Point p )
{
	u16 Dat = 0;
	R61509V_SetGramAddress( p );
	R61509V_ReadData();
	Dat = R61509V_ReadData();
	return(Dat);
}


