wegam/STM32F10xUSBE/FWLIB/Lib/PHY/R61509V.c
/*******************************************************************************
*函数名		:	Address_set
*功能描述	:	STM32内部温度传感器配置
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void R61509V_Address_set(unsigned int x1,unsigned int y1,unsigned int x2,unsigned int y2)
{ 
	R61509V_Write_Bus(0x002A);			//设置列地址
	R61509V_WriteData(x1>>8);	    
	R61509V_WriteData(x1&0x00ff);
	R61509V_WriteData(x2>>8);	    
	R61509V_WriteData(x2&0x00ff);
	R61509V_Write_Bus(0x002b);			//设置页地址	
	R61509V_WriteData(y1>>8);	    
	R61509V_WriteData(y1&0x00ff);
	R61509V_WriteData(y2>>8);	    
	R61509V_WriteData(y2&0x00ff);
	R61509V_Write_Bus(0x002c);			//写内存起始地址 					 						 
}
///*******************************************************************************
//*函数名		:	LCD_Fill
//*功能描述	:	在指定区域内填充指定颜色
//*输入			: 区域大小:(xend-xsta)*(yend-ysta)
//*输出			:	无
//*返回值		:	无
//*例程			:
//*******************************************************************************/
//void R61509V_Fill(
//							u16 xsta,u16 ysta,
//							u16 xend,u16 yend,u16 color
//)
//{          
//	u16 i,j; 
//	R61509V_Address_set(xsta,ysta,xend,yend);      //设置光标位置 
//	for(i=ysta;i<=yend;i++)
//	{													   	 	
//		for(j=xsta;j<=xend;j++)
//			R61509V_WriteData(color);//设置光标位置 	    
//	} 					  	    
//}

/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/

#if 1
//写16位数据：
void R61509V_WriteData16(unsigned int dashuju)			//写16位数据
{
	R61509V_CS_LOW; //片选打开
	R61509V_RS_HIGH; //数据
	R61509V_WR_LOW;
	R61509V_Delay(20);
	R61509V_DATABUS_PORT->ODR = dashuju;
	R61509V_Delay(20);
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
	R61509V_Delay(20);
}

//写16位命令：
void R61509V_WriteIndex16(unsigned int damingling)	//写16位命令索引编号
{
	R61509V_CS_LOW; //片选打开
	R61509V_RS_LOW; //命令
	R61509V_WR_LOW;
	R61509V_Delay(20);
	R61509V_DATABUS_PORT->ODR = damingling;
	R61509V_Delay(20);
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
	R61509V_Delay(20);
}

#else
//写8位数据：
void R61509V_WriteData16(unsigned int dashuju)			//写16位数据
{
	//****写入高位
	R61509V_CS_LOW; //片选打开
	R61509V_RS_HIGH; //数据
	R61509V_WR_LOW;
	DATA=dashuju>>8;
	R61509V_WR_HIGH;
//****写入低位
	R61509V_WR_LOW;
	DATA=dashuju;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}

//写16位命令：
void R61509V_WriteIndex16(unsigned int damingling)		//写16位命令索引编号
{
	//****写入高位
	R61509V_CS_LOW; //片选打开
	R61509V_RS_LOW; //命令
	R61509V_WR_LOW;
	DATA=damingling>>8;
	R61509V_WR_HIGH;
	//****写入低位
	R61509V_WR_LOW;
	DATA=damingling;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}
#endif
/*******************************************************************************
*函数名			:	R61509V_WriteCommand
*功能描述		:	写完整控制命令
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_WriteCommand(												//写完整控制命令
													unsigned int index,			//寄存器索引
													unsigned int Command		//命令
													)	//写完整控制命令
{
	R61509V_WriteIndex16(index);		//写16位命令索引编号
	R61509V_Delay(10);
	R61509V_WriteData16(Command);
}
/*******************************************************************************
*函数名			:	R61509V_SetWindowAddress
*功能描述		:	设置窗口地址
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_SetWindowAddress(			//设置窗口地址
															unsigned int x1,
															unsigned int y1,
															unsigned int x2,
															unsigned int y2
															)
{	
#if 0	
	R61509V_WriteCommand(0x210,x1);			//Window Horizontal RAM Address Start(R210h)
//	R61509V_Delay(100);
	R61509V_WriteCommand(0x211,x2);			//Window Horizontal RAM Address End(R211h)
//	R61509V_Delay(100);
	R61509V_WriteCommand(0x212,y1);			//Window Vertical RAM Address Start (R212h)
//	R61509V_Delay(100);
	R61509V_WriteCommand(0x213,y2);			//Window Vertical RAM Address End (R213h)
//	R61509V_Delay(100);
	
	R61509V_WriteCommand(0x200,x1);			//RAM Address Set (Horizontal Address) (R200h)
//	R61509V_Delay(100);
	R61509V_WriteCommand(0x201,y1);			//RAM Address Set (Vertical Address) (R201h)
//	R61509V_Delay(100);
	R61509V_WriteIndex16(0x0202);				//GRAM(Graphics RAM--图形内存) Data Write (R202h)准备写入
//	R61509V_Delay(100);		//准备写

#else
	
	R61509V_WriteCommand(0x210,x1);			//Window Horizontal RAM Address Start(R210h)
	R61509V_WriteCommand(0x211,x2);			//Window Horizontal RAM Address End(R211h)
	R61509V_WriteCommand(0x212,y1);			//Window Vertical RAM Address Start (R212h)
	R61509V_WriteCommand(0x213,y2);			//Window Vertical RAM Address End (R213h)
	
	R61509V_WriteCommand(0x200,x1);			//RAM Address Set (Horizontal Address) (R200h)
	R61509V_WriteCommand(0x201,y1);			//RAM Address Set (Vertical Address) (R201h)
	
	R61509V_WriteCommand(0x003,0X5030);			//RAM Address Set (Vertical Address) (R201h)
	
	R61509V_WriteIndex16(0x0202);				//GRAM(Graphics RAM--图形内存) Data Write (R202h)准备写入
#endif
}


/*******************************************************************************
*函数名			:	R61509V_Initialize
*功能描述		:	IC初始化：按照主控芯片R61509V的power supply on sequence 进行配置
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_Initialize(void)			//按照主控芯片R61509V的power supply on sequence 进行配置
{
	u32 dtime=500;
	#if 1
	R61509V_WR_HIGH;
	R61509V_RD_HIGH;
	R61509V_CS_LOW;
	R61509V_RST_HIGH;
	R61509V_Delay(dtime);
	R61509V_RST_LOW;
	R61509V_Delay(dtime);
	R61509V_RST_HIGH;
	
