wegam/STM32F10xUSBE/FWLIB/Lib/PHY/R61509V.c
//	R61509V_WriteIndex16(0X202);					R61509V_Delay(dtime);		//准备写入

//	Sreen_Rotate=SCREEN_ROTATE_270D;				//显示方式
	



//	R61509V_WR_HIGH;
//	R61509V_RD_HIGH;
//	R61509V_CS_LOW;
//	R61509V_RST_HIGH;
//	R61509V_Delay(dtime);
//	R61509V_RST_LOW;
//	R61509V_Delay(dtime);
//	R61509V_RST_HIGH;
//	
//	R61509V_WriteCommand(R61509V_R000_IR,0x00);			R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR,0x00);			R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR,0x00);			R61509V_Delay(dtime); //四次写0x00
//	R61509V_WriteCommand(R61509V_R000_IR,0x00);			R61509V_Delay(dtime); //四次写0x00
//	
//	R61509V_WriteCommand(R61509V_R400_BINL,0X6400);		R61509V_Delay(dtime); //base image 设置 400线
//	R61509V_WriteCommand(0X008,0X0808);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(0X300,0X0C00);		R61509V_Delay(dtime); //--------
//	R61509V_WriteCommand(0X010,0X0019);		R61509V_Delay(dtime); //面板频率
//	R61509V_WriteCommand(0X100,0X330);		R61509V_Delay(dtime);	//设置电源控制，平衡显示与电消耗
//	R61509V_WriteCommand(0x102,0xd1b0);		R61509V_Delay(dtime);	//PSON,PON 都设为1，电源供应打开
//	R61509V_WriteCommand(0x280,0xbf00);		R61509V_Delay(dtime);	//VCM


//	
//	R61509V_WriteCommand(0X0003,0X5030);	R61509V_Delay(500);	//RGB设为5-6-5模式------------0X5030

//	R61509V_WriteCommand(0X0001,0X0100);	R61509V_Delay(dtime);	//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	R61509V_WriteCommand(0X007,0X0100);		R61509V_Delay(dtime);	//测试显示控制base image的关与开

//	R61509V_WriteCommand(0X200,0X00);			R61509V_Delay(dtime); //设置RAM ADDRESS

//	R61509V_WriteCommand(0X201,0X00);			R61509V_Delay(dtime); 


//	R61509V_WriteCommand(0X401,0X01);			R61509V_Delay(dtime); //设置base image 滚动模式，开启滚动

//	R61509V_WriteCommand(0x0C,0x0000);		R61509V_Delay(dtime); //外部显示接口控制，默认值
//	R61509V_WriteCommand(0x090,0x8000);		R61509V_Delay(dtime); //窗特征控制，FMARK interface
//	R61509V_WriteCommand(0X404,0X00);			R61509V_Delay(dtime);  //从0线开始滚
//	

//	
//	
//	R61509V_WriteCommand(0X502,0X5f);			R61509V_Delay(dtime);
//	
//	
//	
//	R61509V_WriteCommand(0x200,0x0000);		R61509V_Delay(dtime);		//RAM address 设置

//	R61509V_WriteCommand(0x201,0x0000);		R61509V_Delay(dtime);

//	R61509V_WriteIndex16(0X202);					R61509V_Delay(dtime);		//准备写入


//	Sreen_Rotate=SCREEN_ROTATE_270D;				//显示方式
	
	
	#else
	
	
	R61509V_WR_HIGH;
	R61509V_RD_HIGH;
	R61509V_CS_LOW;
	R61509V_RST_HIGH;
	R61509V_Delay(200);
	R61509V_RST_LOW;
	R61509V_Delay(2000);
	R61509V_RST_HIGH;
	
	
	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500); //四次写0x00
	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
	R61509V_WriteCommand(0X400,0X6200); //base image 设置 400线
	R61509V_WriteCommand(0X010,0X0019); //面板频率
	R61509V_WriteCommand(0X100,0X330);	//设置电源控制，平衡显示与电消耗
	R61509V_WriteCommand(0x102,0xd1b0);R61509V_Delay(500);//PSON,PON 都设为1，电源供应打开
	R61509V_WriteCommand(0x280,0xbf00);R61509V_Delay(500);//VCM
	R61509V_Delay(500);
	R61509V_WriteCommand(0X0003,0X5030);R61509V_Delay(500);//RGB设为5-6-5模式
	R61509V_Delay(200);
	R61509V_WriteCommand(0X0001,0X0100);//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
	R61509V_WriteCommand(0X007,0X0100);//测试显示控制base image的关与开
	R61509V_Delay(200);
	R61509V_Delay(200);
	R61509V_WriteCommand(0X200,0X00); //设置RAM ADDRESS
	R61509V_Delay(200);
	R61509V_WriteCommand(0X201,0X00); 
	R61509V_Delay(200);


	R61509V_Delay(200);
	R61509V_WriteCommand(0X401,0X01); 										//设置base image 滚动模式，开启滚动
	R61509V_Delay(200);
	R61509V_WriteCommand(0x0C,0x0000);R61509V_Delay(1000); //外部显示接口控制，默认值
	R61509V_WriteCommand(0x090,0x8000);R61509V_Delay(1000); //窗特征控制，FMARK interface
	R61509V_WriteCommand(0X404,0X00);R61509V_Delay(1000);  //从0线开始滚
	R61509V_WriteCommand(0X502,0X5f);R61509V_Delay(1000);
	R61509V_WriteCommand(0x200,0x0000);		//RAM address 设置
	R61509V_Delay(1000);
	R61509V_WriteCommand(0x201,0x0000);
	R61509V_Delay(1000);
	R61509V_Delay(1000);
	R61509V_WriteIndex16(0X202);		//准备写入
	R61509V_Delay(1000);
	#endif
}
/*******************************************************************************
*函数名			:	R61509V_Initialize
*功能描述		:	IC初始化：按照主控芯片R61509V的power supply on sequence 进行配置
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_InitializeB(void)			//按照主控芯片R61509V的power supply on sequence 进行配置
{
//	#if 1
//	R61509V_WR_HIGH;
//	R61509V_RD_HIGH;
//	R61509V_CS_LOW;
//	R61509V_RST_HIGH;
//	R61509V_Delay(200);
//	R61509V_RST_LOW;
//	R61509V_Delay(2000);
//	R61509V_RST_HIGH;
//	
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500); //四次写0x00
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0X400,0X6200); //base image 设置 400线
//	R61509V_WriteCommand(0X010,0X0019); //面板频率
//	R61509V_WriteCommand(0X100,0X330);	//设置电源控制，平衡显示与电消耗
//	R61509V_WriteCommand(0x102,0xd1b0);R61509V_Delay(500);//PSON,PON 都设为1，电源供应打开
//	R61509V_WriteCommand(0x280,0xbf00);R61509V_Delay(500);//VCM
//	R61509V_Delay(500);
//	R61509V_WriteCommand(0X0003,0X5030);R61509V_Delay(500);//RGB设为5-6-5模式
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X0001,0X0100);//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	R61509V_WriteCommand(0X007,0X0100);//测试显示控制base image的关与开
//	R61509V_Delay(200);
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X200,0X00); //设置RAM ADDRESS
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X201,0X00); 
//	R61509V_Delay(200);


//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X401,0X01); //设置base image 滚动模式，开启滚动
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0x0C,0x0000);R61509V_Delay(1000); //外部显示接口控制，默认值
//	R61509V_WriteCommand(0x090,0x8000);R61509V_Delay(1000); //窗特征控制，FMARK interface
//	R61509V_WriteCommand(0X404,0X00);R61509V_Delay(1000);  //从0线开始滚
//	R61509V_WriteCommand(0X502,0X5f);R61509V_Delay(1000);
//	R61509V_WriteCommand(0x200,0x0000);		//RAM address 设置
//	R61509V_Delay(1000);
//	R61509V_WriteCommand(0x201,0x0000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_WriteIndex16(0X202);		//准备写入
//	R61509V_Delay(1000);
//	
//	#else
//	R61509V_WR_HIGH;
//	R61509V_RD_HIGH;
//	R61509V_CS_LOW;
//	R61509V_RST_HIGH;
//	R61509V_Delay(200);
//	R61509V_RST_LOW;
//	R61509V_Delay(2000);
//	R61509V_RST_HIGH;
//	
//	
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500); //四次写0x00
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0x00,0x00);R61509V_Delay(500);
//	R61509V_WriteCommand(0X400,0X6200); //base image 设置 400线
//	R61509V_WriteCommand(0X010,0X0019); //面板频率
//	R61509V_WriteCommand(0X100,0X330);	//设置电源控制，平衡显示与电消耗
//	R61509V_WriteCommand(0x102,0xd1b0);R61509V_Delay(500);//PSON,PON 都设为1，电源供应打开
//	R61509V_WriteCommand(0x280,0xbf00);R61509V_Delay(500);//VCM
//	R61509V_Delay(500);
//	R61509V_WriteCommand(0X0003,0X5030);R61509V_Delay(500);//RGB设为5-6-5模式
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X0001,0X0100);//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	R61509V_WriteCommand(0X007,0X0100);//测试显示控制base image的关与开
//	R61509V_Delay(200);
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X200,0X00); //设置RAM ADDRESS
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X201,0X00); 
//	R61509V_Delay(200);


//	R61509V_Delay(200);
//	R61509V_WriteCommand(0X401,0X01); //设置base image 滚动模式，开启滚动
//	R61509V_Delay(200);
//	R61509V_WriteCommand(0x0C,0x0000);R61509V_Delay(1000); //外部显示接口控制，默认值
//	R61509V_WriteCommand(0x090,0x8000);R61509V_Delay(1000); //窗特征控制，FMARK interface
//	R61509V_WriteCommand(0X404,0X00);R61509V_Delay(1000);  //从0线开始滚
//	R61509V_WriteCommand(0X502,0X5f);R61509V_Delay(1000);
//	R61509V_WriteCommand(0x200,0x0000);		//RAM address 设置
//	R61509V_Delay(1000);
//	R61509V_WriteCommand(0x201,0x0000);
//	R61509V_Delay(1000);
//	R61509V_Delay(1000);
//	R61509V_WriteIndex16(0X202);		//准备写入
//	R61509V_Delay(1000);
//	#endif
}
/*******************************************************************************
*函数名			:	R61509V_Clean
*功能描述		:	清屏程序：清除屏幕函数---用背景色填充屏幕
*输入				: 
*返回值			:	无
*******************************************************************************/
void R61509V_Clean(u16 COLOR)	//清除屏幕函数
{
	unsigned char i;
	unsigned int j;

